app/Controllers/Galeri.php

    public function index(): string
    {
        $galeri = $this->db->table('galeri')->get()->getResult();
---
SELECT *
FROM `galeri`

    public function delete($id)
    {
        $model = new ModelGaleri();
        $dt = $model->pilihGaleri($id)->getRow();

        if (!empty($gambar = $dt->gambar)) {
            $path = '../public/assets/img/upload/';
            unlink($path . $gambar);
        }
        $this->db->table('galeri')->delete(array('id' => $id));
---
DELETE FROM `galeri`
WHERE `id` = '9'