app/Controllers/Home.php

    public function galeri(): string
    {
        $galeri = $this->db->table('galeri')->get()->getResult();
---
SELECT *
FROM `galeri`

    public function destinasi(): string
    {
        $destinasi = $this->db->table('destinasi')->get()->getResult();
---
SELECT *
FROM `destinasi`

    public function detail_destinasi($id): string
    {
        $destinasi = $this->db->table('destinasi')->where('id', $id)->get()->getResult();
---
SELECT *
FROM `destinasi`
WHERE `id` = '14'

    public function potensi(): string
    {
        $potensi = $this->db->table('potensi')->get()->getResult();
---
SELECT *
FROM `potensi`