app/Controllers/Pesanan.php

    public function delete($id)
    {
        $this->db->table('pesanan')->delete(array('id' => $id));

        return redirect()->to('pesanan')->with('berhasil', 'Data Berhasil dihapus');
---
SELECT `pesanan`.*, `paket`.`nama_paket`
FROM `pesanan`
JOIN `paket` ON `paket`.`id` = `pesanan`.`id_paket`