app/Controllers/Pesanan.php

SELECT *
FROM `pesanan`
---
    public function index()
    {
        $pesanan = $this->db->table('pesanan')->get()->getResult();

SELECT *
FROM `pesanan`
WHERE `tanggal` BETWEEN '2024-06-07' AND '2024-06-14'
ORDER BY `id` ASC
---
    public function choose_date()
    {
        $from  = @$_POST['mulai_tanggal'];
        $to = @$_POST['sampai_tanggal'];

        $pesanan = $this->db->table('pesanan')
            ->where("tanggal BETWEEN '{$from}' AND '{$to}'")
            ->orderBy('id', 'ASC')
            ->get()
            ->getResult();

SELECT *
FROM `pesanan`
---
    public function edit($id)
    {
        $model = new ModelPesanan();
        helper('form');
        $pesanan = $model->pilihPesanan($id)->getRow();