app/Controllers/Potensi.php

SELECT *
FROM `potensi`
---
    public function index()
    {
        $potensi = $this->db->table('potensi')->get()->getResult();