app/Models/ModelPesanan.php

SELECT `pesanan`.*, `paket`.`nama_paket`
FROM `pesanan`
JOIN `paket` ON `paket`.`id` = `pesanan`.`id_paket`
WHERE `tanggal` BETWEEN '2024-06-07' AND '2024-06-14'
ORDER BY `id` ASC
---
    public function choose_date()
    {
        $from  = @$_POST['mulai_tanggal'];
        $to = @$_POST['sampai_tanggal'];

        return $this->db->table('pesanan')
            ->select('pesanan.*, paket.nama_paket')
            ->join('paket', 'paket.id = pesanan.id_paket')
            ->where("tanggal BETWEEN '{$from}' AND '{$to}'")
            ->orderBy('id', 'ASC')
            ->get()
            ->getResult();