app/Models/ModelPaket.php

    public function getData()
    {
        $paket = $this->db->table('paket')->get()->getResult();
---
SELECT *
FROM `paket`

    public function pilihPaket($id)
    {
        $query = $this->getWhere(['id' => $id]);
---
SELECT *
FROM `paket`
WHERE `id` = '1'

    public function data_destinasi($id)
    {
        $builder = $this->db->table('detail_paket');
        $builder->select('destinasi.nama_wisata');
        $builder->join('destinasi', 'destinasi.id = detail_paket.id_destinasi');
        $builder->join('paket', 'paket.id = detail_paket.id_paket');
        $builder->where('id_paket', $id);
        $query = $builder->get()->getResult();
---
SELECT `destinasi`.`nama_wisata`
FROM `detail_paket`
JOIN `destinasi` ON `destinasi`.`id` = `detail_paket`.`id_destinasi`
JOIN `paket` ON `paket`.`id` = `detail_paket`.`id_paket`
WHERE `id_paket` = '1'