app/Models/ModelFeedback.php

SELECT *
FROM `feedback`
WHERE `id` = '3'
---
    public function pilihFeedback($id)
    {
        $query = $this->getWhere(['id' => $id]);

UPDATE `feedback` SET `status` = 'Sudah Dibaca'
WHERE `id` = '3'
---
    public function edit_data($id, $data)
    {
        $query = $this->db->table($this->table)->where('id', $id)->update($data);