app/Models/ModelGaleri.php

SELECT *
FROM `galeri`
WHERE `id` = '9'
---
    public function pilihGaleri($id)
    {
        $query = $this->getWhere(['id' => $id]);