app/Models/ModelPotensi.php

SELECT *
FROM `potensi`
WHERE `id` = '1'
---
    public function pilihPotensi($id)
    {
        $query = $this->getWhere(['id' => $id]);